# IFC_GetNumPsets2

## Description
Returns the number of psets for the specified ifc type.

```pascal
FUNCTION IFC_GetNumPsets2(
				hObject         : HANDLE;
				bAllPsets       : BOOLEAN;
				VAR outNumPsets : INTEGER) : BOOLEAN;
```

```python

def vs.IFC_GetNumPsets2(hObject, bAllPsets):
    return (BOOLEAN, outNumPsets)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE||
|bAllPsets|BOOLEAN||
|outNumPsets|INTEGER||

## Version
Availability: from Vectorworks 2018
## Category
* IFC